posts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blog Posts</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wiljam" />
<meta name="description" content="Header"
 />

<meta http-equiv="Cache-Control" content="no-cache, no-store, must-revalidate" />
<meta http-equiv="Pragma" content="no-cache" />
<meta http-equiv="Expires" content="-1" />
<link rel="stylesheet" href="/static/gruvbox-dark-medium.min.css" />
<link rel="stylesheet" href="/static/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Blog Posts</h1>
<div class="header">
  <span class="header-menu"><a href="/">Home</a></span>
  <span class="header-menu"><a href="/articles.html">Articles</a></span>
  <span class="header-menu"><a href="/posts.html">Blog</a></span>
  <span class="header-menu"><a href="/contact.html">Contact</a></span>
</div>

<div id="outline-container-org1c451bf" class="outline-2">
<h2 id="org1c451bf">13.02.2023</h2>
<div class="outline-text-2" id="text-org1c451bf">
<p>
I'm thinking about redesigning this whole site, maybe in some retro-tech style. We'll see.
</p>
</div>
</div>

<div id="outline-container-org00b5d59" class="outline-2">
<h2 id="org00b5d59">11.02.2023</h2>
<div class="outline-text-2" id="text-org00b5d59">
<p>
I think that creating static websites like blogs in pure text formats, like org-mode or Markdown creates better writing expierence
than HTML. Also watching circles spin and build tasks executing in GitHub actions is extremely satysfying.
</p>
</div>
</div>

<div id="outline-container-orgc0f139a" class="outline-2">
<h2 id="orgc0f139a">10.02.2023</h2>
<div class="outline-text-2" id="text-orgc0f139a">
<p>
So, today I wrote my first article and I can already say a few things: writing is hard, especially if it's not your first langauge.
Second thing I noticed is that I overuse comments to describe code, I think more text would do a better job. Today is the day I also
created GitHub pages site, and creating the deploy scripts was really painful, GitHub should document their things better. Today was a great day.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Wiljam</p>
</div>
</body>
</html>
